Repository: tcollart/intra42
Catalog: framework2/apps/core/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Username
fr: Nom d'utilisateur

source: Email
fr: Adresse email

source: Password
fr: Mot de passe

source: Submit
fr: Valider

source: Elements to set up:
fr: Elements a mettre en place

source: As first feature, on your index, you should be able to choose a language. The whole website will be translated in this language. Use your framework. The chosen language is saved as user preference for his next visit.
fr: Comme premiere feature, sur votre page d’accueil, vous devez pouvoir choisir la langue de votre site. Tout le site sera traduit dans la langue selectionne. Pensez a utiliser votre framework. Quand vous vous deloguer de votre site, il doit enregistrer la langue choisie pour une prochaine connexion.

source: You should be able to create / modify / delete categories.
fr: Vous devez pouvoir ajouter / modifier / supprimer des categories.

source: ChildCategories:
fr: Sous-categories :

source: Same for the child-categories.
fr: Meme chose que pour les categories.

source: A thread belongs to a category or a child-category. You should be able to answer to a thread and comment an answer.
fr: Les threads peuvent appartenir a une categorie ou une sous-categorie. Vous devez pouvoir repondre dans un thread et commenter un reponse.

source: Ticket creation:
fr: Creation de ticket :

source: Users can create a ticket.
fr: Tous les utilisateurs peuvent creer un ticket.

source: Ticket spool:
fr: Spool de ticket :

source: Created tickets are listed in the spool, only an admin user can access the spool. Here, an admin user can answer or attribute a ticket to another admin user.
fr: Les tickets crees arrivent dans le spool, seuls les admins ont acces. C’est ici ou les admins peuvent repondre ou attribuer le ticket a un autre admin.

source: Ticket status:
fr: Etat d’un ticket :

source: A ticket is open or closed. Once closed, it can be reopened by its author or an admin user.
fr: Le ticket peut etre ouvert ou ferme. Une fois ferme, il peut etre reouvert celui qui l’a cree ou l’admin.

source: Sign in
fr: Se connecter

source: Sign up
fr: S'enregistrer

source: Register
fr: S'enregistrer
